web/app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    @posts = Post.all.order(created_at: :desc)

INSERT INTO "posts" ("content", "created_at", "updated_at", "user_id", "photo", "food_name", "address", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @post = Post.new(
        content: params[:content],
        user_id: @current_user.id,
        photo: params[:photo],
        star: params[:start],
        food_name: params[:food_name],
        address: params[:address]
    )

    if @post.save