app/controllers/users_controller.rb

  def edit
    @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.new(name: params[:name], email: params[:email], image_name: "profile.png", password: params[:password])
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "image_name", "password_digest") VALUES (?, ?, ?, ?, ?, ?)

  def login
    @user = User.find_by(email: params[:email], password: params[:password])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "chac0ptx@gmail.com"], ["LIMIT", 1]]

  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ?  [["user_id", 1]]